# Mathematical Functions on Dataframe:

---

In [7]:
import pandas as pd
import numpy as np

In [8]:
df= pd.read_csv('C:/Users/anike/OneDrive/Desktop/Learning Pandas/Datasets/Session-17/ipl-matches.csv')
ipl= pd.DataFrame(df)
df= pd.read_csv('C:/Users/anike/OneDrive/Desktop/Learning Pandas/Datasets/Session-17/movies.csv')
movies= pd.DataFrame(df)

---

## .sum():
- returns column wise sum of the dataframe.
- returns row wise sum when axis=1.

In [10]:
student= pd.DataFrame([
    [1, 2, 3],
    [4, 5, 6], 
    [7, 8, 9]

    ])
student.sum()  # column wise sum

0    12
1    15
2    18
dtype: int64

In [11]:
student.sum(axis=1)  # row wise sum

0     6
1    15
2    24
dtype: int64

---

## .mean():
- returns column wise mean of the dataframe.
- returns row wise mean when axis=1.

In [ ]:
student.mean()  # column wise mean

0    4.0
1    5.0
2    6.0
dtype: float64

---

# NOTE:
Similarly there are mathematicals for .var(), .min(), .max(), .median(), std(),etc.

---

# Selecting COlumns from a dataframe:

## Fetching single column from a dataframe:

In [16]:
movies['title_x']  # selecting a single column

0                   Uri: The Surgical Strike
1                              Battalion 609
2       The Accidental Prime Minister (film)
3                            Why Cheat India
4                            Evening Shadows
                        ...
1624                   Tera Mera Saath Rahen
1625                    Yeh Zindagi Ka Safar
1626                         Sabse Bada Sukh
1627                                   Daaka
1628                                Humsafar
Name: title_x, Length: 1629, dtype: object

In [17]:
type(movies['title_x'])  # returns a series

pandas.core.series.Series

## Fetching multiple columns:

In [20]:
movies[['title_x','year_of_release','actors']]  # selecting multiple columns

,title_x,year_of_release,actors
0,Uri: The Surgical Strike,2019,Vicky Kaushal|Paresh Rawal|Mohit Raina|Yami Ga...
1,Battalion 609,2019,Vicky Ahuja|Shoaib Ibrahim|Shrikant Kamat|Elen...
2,The Accidental Prime Minister (film),2019,Anupam Kher|Akshaye Khanna|Aahana Kumra|Atul S...
3,Why Cheat India,2019,Emraan Hashmi|Shreya Dhanwanthary|Snighdadeep ...
4,Evening Shadows,2018,Mona Ambegaonkar|Ananth Narayan Mahadevan|Deva...
...,...,...,...
1624,Tera Mera Saath Rahen,2001,Ajay Devgn|Sonali Bendre|Namrata Shirodkar|Pre...
1625,Yeh Zindagi Ka Safar,2001,Ameesha Patel|Jimmy Sheirgill|Nafisa Ali|Gulsh...
1626,Sabse Bada Sukh,2018,Vijay Arora|Asrani|Rajni Bala|Kumud Damle|Utpa...
1627,Daaka,2019,Gippy Grewal|Zareen Khan|
1628,Humsafar,2011,Fawad Khan|

In [21]:
type(movies[['title_x','year_of_release','actors']])  # returns a dataframe

pandas.core.frame.DataFrame

---

## loc() and iloc():
- loc()--> returns series based on label.
- iloc()---> retruns a series based on indexing.

In [23]:
data = {
    'Name': ['Aniket', 'Ravi', 'Sneha', 'Pooja', 'Aman'],
    'Age': [21, 22, 20, 23, 21],
    'City': ['Patna', 'Delhi', 'Mumbai', 'Bangalore', 'Ranchi'],
    'Score': [85, 90, 78, 88, 92]
}

df = pd.DataFrame(data, index=['A1', 'A2', 'A3', 'A4', 'A5'])
df

      Name  Age       City  Score
A1  Aniket   21      Patna     85
A2    Ravi   22      Delhi     90
A3   Sneha   20     Mumbai     78
A4   Pooja   23  Bangalore     88
A5    Aman   21     Ranchi     92

In [24]:
df.loc['A1']  # returns the row with index 'A1'

Name     Aniket
Age          21
City      Patna
Score        85
Name: A1, dtype: object

In [28]:
df.loc['A1': 'A3']  # returns the row from index 'A1' to 'A3'

      Name  Age    City  Score
A1  Aniket   21   Patna     85
A2    Ravi   22   Delhi     90
A3   Sneha   20  Mumbai     78

In [30]:
df.iloc[0]  # returns the first row based on index as series

Name     Aniket
Age          21
City      Patna
Score        85
Name: A1, dtype: object

In [32]:
df.iloc[0:3]

      Name  Age    City  Score
A1  Aniket   21   Patna     85
A2    Ravi   22   Delhi     90
A3   Sneha   20  Mumbai     78

---

## Selecting rows and columns using loc() and iloc():
- loc() --> returns series based on label.
- iloc() --> returns a series based on indexing.
- loc[] and iloc[] can be used to select specific rows and columns from a DataFrame.

In [ ]:
movies.iloc[0:3, 0:3]  # returns the first three rows and first three columns

,title_x,imdb_id,poster_path
0,Uri: The Surgical Strike,tt8291224,https://upload.wikimedia.org/wikipedia/en/thum...
1,Battalion 609,tt9472208,NaN
2,The Accidental Prime Minister (film),tt6986710,https://upload.wikimedia.org/wikipedia/en/thum...

In [37]:
movies.loc[0:2,'title_x':'poster_path']  # returns rows from 'title_x' to 'actors'

,title_x,imdb_id,poster_path
0,Uri: The Surgical Strike,tt8291224,https://upload.wikimedia.org/wikipedia/en/thum...
1,Battalion 609,tt9472208,NaN
2,The Accidental Prime Minister (film),tt6986710,https://upload.wikimedia.org/wikipedia/en/thum...

---